import { defineStore } from "pinia";
//25.193, 121.4344
export const useDataStore = defineStore("data", {
  state: () => {
    return {
      geojsonFeature: {
        type: "FeatureCollection",
        features: [
          {
            type: "Feature",
            properties: {
              type: "s1",
              description: "<h1>這</h1><h2>是</h2><h3>下</h3><h4>坡</h4>",
              name: "下坡",
            },
            geometry: {
              type: "Point",
              coordinates: [121.4325, 25.1941],
            },
          },
          {
            type: "Feature",
            properties: {
              type: "s2",
              description:
                "右轉彎時，應靠右側路邊右轉。<i>但行駛於二車道以上</i>之單行道左側車道或<u>左側慢車道者</u>，應採兩段方式右轉。",
              name: "前方右轉",
            },
            geometry: {
              type: "Point",
              coordinates: [121.4399, 25.2002],
            },
          },

          {
            type: "Feature",
            properties: {
              type: "l2",
              description: "2",
            },
            geometry: {
              coordinates: [
                [121.43067818411504, 25.19063653086033],
                [121.42461458272618, 25.191302307452077],
                [121.42207751101495, 25.191899207509067],
                [121.4211387944818, 25.190705404470066],
                [121.41730781619833, 25.187583095053952],
              ],
              type: "LineString",
            },
          },
          {
            type: "Feature",
            properties: {
              type: "l3",
              description:
                "<h1>限速40</h1>原PO在臉書社團「爆廢公社二館」發文表示，「現在真會搶錢，最近很多朋友都給政府搶了」，提到許多道路現在都規定限速40公里、50公里，但他連腳踏車都能騎到時速45公里，直呼現在的交通測速是爛的可以。",
              name: "限速400",
            },
            geometry: {
              coordinates: [
                [121.42863692301466, 25.20020850628636],
                [121.4335232740047, 25.198274174363206],
                [121.43932581580373, 25.197652418290232],
              ],
              type: "LineString",
            },
          },
          {
            type: "Feature",
            properties: {
              type: "l3",
              description:
                "<h1>限速40</h1>原PO在臉書社團「爆廢公社二館」發文表示，「現在真會搶錢，最近很多朋友都給政府搶了」，提到許多道路現在都規定限速40公里、50公里，但他連腳踏車都能騎到時速45公里，直呼現在的交通測速是爛的可以。",
              name: "限速400",
            },
            geometry: {
              coordinates: [
                [121.4293240661222, 25.201797398806534],
                [121.43230168625678, 25.20062300198633],
                [121.42978216152818, 25.19495810529196],
              ],
              type: "LineString",
            },
          },

          {
            type: "Feature",
            properties: {
              type: "l4",
              description: "1",
            },
            geometry: {
              coordinates: [
                [121.44454217368121, 25.19242024042107],
                [121.44370353029092, 25.189522685294534],
                [121.44385601090761, 25.188625809025012],
                [121.4446946542979, 25.180760611230028],
                [121.4444659333729, 25.178621741576478],
                [121.44393225121604, 25.1782077624689],
              ],
              type: "LineString",
            },
          },

          {
            type: "Feature",
            properties: {
              type: "l4",
              description: "1",
            },
            geometry: {
              coordinates: [
                [121.4265745453589, 25.196008547872168],
                [121.42525526806901, 25.19412607050363],
                [121.42459562942412, 25.192564969640515],
                [121.42500156089653, 25.1911875110857],
              ],
              type: "LineString",
            },
          },
          {
            type: "Feature",
            properties: {
              type: "l1",
              description: "1",
            },
            geometry: {
              coordinates: [
                [121.43469173119331, 25.201466942237317],
                [121.43071319930954, 25.190666943604512],
                [121.44356691770435, 25.188936085554914],
                [121.4470098779878, 25.189005320349153],
              ],
              type: "LineString",
            },
          },
          {
            type: "Feature",
            properties: {
              type: "l1",
              description: "1",
            },
            geometry: {
              coordinates: [
                [121.4298127656728, 25.203332244011193],
                [121.43485523648502, 25.201396648387473],
                [121.43959210300693, 25.20035970950208],
                [121.43852248798663, 25.19303175635612],
                [121.43179919356879, 25.193999624497664],
                [121.4263747173901, 25.196004469751827],
                [121.4298127656728, 25.203401371857197],
              ],
              type: "LineString",
            },
          },
          //
        ],
      },
    };
  },
});
